stevenj/avr-libc3/include/avr/io/attiny15.h
/*
--------------------------------------------------------------------------------
PORT - I/O Port
--------------------------------------------------------------------------------
*/

typedef struct PORTB_struct
{
    register8_t rsv_0x00[22]; /* RESERVED REGISTER BLOCK */
    register8_t PINB;         /* Input Pins, Port B */
    register8_t DDRB;         /* Data Direction Register, Port B */
    register8_t PORTB;        /* Data Register, Port B */
} PORTB_t;


/*
--------------------------------------------------------------------------------
TC8 - Timer/Counter, 8-bit
--------------------------------------------------------------------------------
*/

typedef struct TC0_struct
{
    register8_t rsv_0x00[50]; /* RESERVED REGISTER BLOCK */
    register8_t TCNT0;        /* Timer Counter 0 */
    register8_t TCCR0;        /* Timer/Counter0 Control Register */
    register8_t rsv_0x34[4];  /* RESERVED REGISTER BLOCK */
    register8_t TIFR;         /* Timer/Counter Interrupt Flag register */
    register8_t TIMSK;        /* Timer/Counter Interrupt Mask Register */
} TC0_t;


/*
--------------------------------------------------------------------------------
TC8 - Timer/Counter, 8-bit
--------------------------------------------------------------------------------
*/

typedef struct TC1_struct
{
    register8_t rsv_0x00[44]; /* RESERVED REGISTER BLOCK */
    register8_t SFIOR;        /* Special Function IO Register */
    register8_t OCR1B;        /* Output Compare Register */
    register8_t OCR1A;        /* Output Compare Register */
    register8_t TCNT1;        /* Timer/Counter Register */
    register8_t TCCR1;        /* Timer/Counter Control Register */
    register8_t rsv_0x31[7];  /* RESERVED REGISTER BLOCK */
    register8_t TIFR;         /* Timer/Counter Interrupt Flag Register */
    register8_t TIMSK;        /* Timer/Counter Interrupt Mask Register */
} TC1_t;


/* Timer/Counter0 Overflow Interrupt Enable */
typedef enum TC0_TOIE0_enum
{
    TC0_TOIE0_CLEAR_gc = (0x00), /* Timer/Counter0 Overflow Interrupt Enable - CLEAR */
    TC0_TOIE0_SET_gc   = (0x02), /* Timer/Counter0 Overflow Interrupt Enable - SET */
} TC0_TOIE0_t;

/* Timer/Counter0 Overflow Flag */
typedef enum TC0_TOV0_enum
{
    TC0_TOV0_CLEAR_gc = (0x00), /* Timer/Counter0 Overflow Flag - CLEAR */
    TC0_TOV0_SET_gc   = (0x02), /* Timer/Counter0 Overflow Flag - SET */
} TC0_TOV0_t;

/* Clock Select0 bit 2 */
typedef enum TC0_CS02_enum
{
    TC0_CS02_VAL_0x00_gc = (0x00<<2), /* No Clock Source (Stopped) */
    TC0_CS02_VAL_0x01_gc = (0x01<<2), /* Running, No Prescaling */
    TC0_CS02_VAL_0x02_gc = (0x02<<2), /* Running, CLK/8 */
    TC0_CS02_VAL_0x03_gc = (0x03<<2), /* Running, CLK/64 */
    TC0_CS02_VAL_0x04_gc = (0x04<<2), /* Running, CLK/256 */
    TC0_CS02_VAL_0x05_gc = (0x05<<2), /* Running, CLK/1024 */
    TC0_CS02_VAL_0x06_gc = (0x06<<2), /* Running, ExtClk Tx Falling Edge */
    TC0_CS02_VAL_0x07_gc = (0x07<<2), /* Running, ExtClk Tx Rising Edge */
} TC0_CS02_t;

/* Clock Select0 bit 1 */
typedef enum TC0_CS01_enum
{
    TC0_CS01_CLEAR_gc = (0x00), /* Clock Select0 bit 1 - CLEAR */
    TC0_CS01_SET_gc   = (0x02), /* Clock Select0 bit 1 - SET */
} TC0_CS01_t;

/* Clock Select0 bit 0 */
typedef enum TC0_CS00_enum
{
    TC0_CS00_CLEAR_gc = (0x00), /* Clock Select0 bit 0 - CLEAR */
    TC0_CS00_SET_gc   = (0x01), /* Clock Select0 bit 0 - SET */
} TC0_CS00_t;

/* Clear Timer/Counter on Compare Match */
typedef enum TC1_CTC1_enum
{
    TC1_CTC1_CLEAR_gc = (0x00), /* Clear Timer/Counter on Compare Match - CLEAR */
    TC1_CTC1_SET_gc   = (0x80), /* Clear Timer/Counter on Compare Match - SET */
} TC1_CTC1_t;

/* Pulse Width Modulator Enable */
typedef enum TC1_PWM1_enum
{
    TC1_PWM1_CLEAR_gc = (0x00), /* Pulse Width Modulator Enable - CLEAR */
    TC1_PWM1_SET_gc   = (0x40), /* Pulse Width Modulator Enable - SET */
} TC1_PWM1_t;

/* Compare Output Mode, Bits */
typedef enum TC1_COM1A_enum
{
    TC1_COM1A_VAL_0x00_gc = (0x00<<4), /* Disconnected from OCn/PWMn */
    TC1_COM1A_VAL_0x01_gc = (0x01<<4), /* Toggle OCn/PWMn output line */
    TC1_COM1A_VAL_0x02_gc = (0x02<<4), /* Clear OCn/PWMn output line */
    TC1_COM1A_VAL_0x03_gc = (0x03<<4), /* set OCn/PWMn output line */
} TC1_COM1A_t;

/* Clock Select Bits */
typedef enum TC1_CS1_enum
{
    TC1_CS1_VAL_0x00_gc = (0x00), /* No Clock Source (Stopped) */
    TC1_CS1_VAL_0x01_gc = (0x01), /* Running, CLK*16 */
    TC1_CS1_VAL_0x02_gc = (0x02), /* Running, CLK*8 */
    TC1_CS1_VAL_0x03_gc = (0x03), /* Running, CLK*4 */
    TC1_CS1_VAL_0x04_gc = (0x04), /* Running, CLK*2 */
    TC1_CS1_VAL_0x05_gc = (0x05), /* Running, No Prescaling */
    TC1_CS1_VAL_0x06_gc = (0x06), /* Running, CLK/2 */
    TC1_CS1_VAL_0x07_gc = (0x07), /* Running, CLK/4 */
    TC1_CS1_VAL_0x08_gc = (0x08), /* Running, CLK/8 */
    TC1_CS1_VAL_0x09_gc = (0x09), /* Running, CLK/16 */
    TC1_CS1_VAL_0x0A_gc = (0x0A), /* Running, CLK/32 */
    TC1_CS1_VAL_0x0B_gc = (0x0B), /* Running, CLK/64 */
    TC1_CS1_VAL_0x0C_gc = (0x0C), /* Running, CLK/128 */
    TC1_CS1_VAL_0x0D_gc = (0x0D), /* Running, CLK/256 */
    TC1_CS1_VAL_0x0E_gc = (0x0E), /* Running, CLK/512 */
    TC1_CS1_VAL_0x0F_gc = (0x0F), /* Running, CLK/1024 */
} TC1_CS1_t;

/* OCIE1A: Timer/Counter1 Output Compare Interrupt Enable */
typedef enum TC1_OCIE1A_enum
{
    TC1_OCIE1A_CLEAR_gc = (0x00), /* OCIE1A: Timer/Counter1 Output Compare Interrupt Enable - CLEAR */
    TC1_OCIE1A_SET_gc   = (0x40), /* OCIE1A: Timer/Counter1 Output Compare Interrupt Enable - SET */
} TC1_OCIE1A_t;

/* Timer/Counter1 Overflow Interrupt Enable */
typedef enum TC1_TOIE1_enum
{
    TC1_TOIE1_CLEAR_gc = (0x00), /* Timer/Counter1 Overflow Interrupt Enable - CLEAR */
    TC1_TOIE1_SET_gc   = (0x04), /* Timer/Counter1 Overflow Interrupt Enable - SET */
} TC1_TOIE1_t;

/* Timer/Counter1 Output Compare Flag 1A */
typedef enum TC1_OCF1A_enum
{
    TC1_OCF1A_CLEAR_gc = (0x00), /* Timer/Counter1 Output Compare Flag 1A - CLEAR */
    TC1_OCF1A_SET_gc   = (0x40), /* Timer/Counter1 Output Compare Flag 1A - SET */
} TC1_OCF1A_t;

/* Timer/Counter1 Overflow Flag */
typedef enum TC1_TOV1_enum
{
    TC1_TOV1_CLEAR_gc = (0x00), /* Timer/Counter1 Overflow Flag - CLEAR */
    TC1_TOV1_SET_gc   = (0x04), /* Timer/Counter1 Overflow Flag - SET */
} TC1_TOV1_t;

/* Force Output Compare 1A */
typedef enum TC1_FOC1A_enum
{
    TC1_FOC1A_CLEAR_gc = (0x00), /* Force Output Compare 1A - CLEAR */
    TC1_FOC1A_SET_gc   = (0x04), /* Force Output Compare 1A - SET */
} TC1_FOC1A_t;

/* Prescaler Reset Timer/Counter1 */
typedef enum TC1_PSR1_enum
{
    TC1_PSR1_CLEAR_gc = (0x00), /* Prescaler Reset Timer/Counter1 - CLEAR */
    TC1_PSR1_SET_gc   = (0x02), /* Prescaler Reset Timer/Counter1 - SET */
} TC1_PSR1_t;

/* Prescaler Reset Timer/Counter0 */
typedef enum TC1_PSR0_enum
{
    TC1_PSR0_CLEAR_gc = (0x00), /* Prescaler Reset Timer/Counter0 - CLEAR */
    TC1_PSR0_SET_gc   = (0x01), /* Prescaler Reset Timer/Counter0 - SET */
} TC1_PSR0_t;

