stevenj/avr-libc3/include/avr/io/attiny15.h
/*
--------------------------------------------------------------------------------
EEPROM - EEPROM
--------------------------------------------------------------------------------
*/


/* EEProm Ready Interrupt Enable */
#define EEPROM_EERIE_CLEAR_gc (0x00) /* EEProm Ready Interrupt Enable - CLEAR */
#define EEPROM_EERIE_SET_gc   (0x08) /* EEProm Ready Interrupt Enable - SET */


/* EEPROM Master Write Enable */
#define EEPROM_EEMWE_CLEAR_gc (0x00) /* EEPROM Master Write Enable - CLEAR */
#define EEPROM_EEMWE_SET_gc   (0x04) /* EEPROM Master Write Enable - SET */


/* EEPROM Write Enable */
#define EEPROM_EEWE_CLEAR_gc (0x00) /* EEPROM Write Enable - CLEAR */
#define EEPROM_EEWE_SET_gc   (0x02) /* EEPROM Write Enable - SET */


/* EEPROM Read Enable */
#define EEPROM_EERE_CLEAR_gc (0x00) /* EEPROM Read Enable - CLEAR */
#define EEPROM_EERE_SET_gc   (0x01) /* EEPROM Read Enable - SET */


/*
--------------------------------------------------------------------------------
PORT - I/O Port
--------------------------------------------------------------------------------
*/


/*
--------------------------------------------------------------------------------
TC8 - Timer/Counter, 8-bit
--------------------------------------------------------------------------------
*/


/*
--------------------------------------------------------------------------------
TC8 - Timer/Counter, 8-bit
--------------------------------------------------------------------------------
*/


/* Timer/Counter0 Overflow Interrupt Enable */
#define TC0_TOIE0_CLEAR_gc (0x00) /* Timer/Counter0 Overflow Interrupt Enable - CLEAR */
#define TC0_TOIE0_SET_gc   (0x02) /* Timer/Counter0 Overflow Interrupt Enable - SET */


/* Timer/Counter0 Overflow Flag */
#define TC0_TOV0_CLEAR_gc (0x00) /* Timer/Counter0 Overflow Flag - CLEAR */
#define TC0_TOV0_SET_gc   (0x02) /* Timer/Counter0 Overflow Flag - SET */


/* Clock Select0 bit 2 */
#define TC0_CS02_VAL_0x00_gc (0x00<<2) /* No Clock Source (Stopped) */
#define TC0_CS02_VAL_0x01_gc (0x01<<2) /* Running, No Prescaling */
#define TC0_CS02_VAL_0x02_gc (0x02<<2) /* Running, CLK/8 */
#define TC0_CS02_VAL_0x03_gc (0x03<<2) /* Running, CLK/64 */
#define TC0_CS02_VAL_0x04_gc (0x04<<2) /* Running, CLK/256 */
#define TC0_CS02_VAL_0x05_gc (0x05<<2) /* Running, CLK/1024 */
#define TC0_CS02_VAL_0x06_gc (0x06<<2) /* Running, ExtClk Tx Falling Edge */
#define TC0_CS02_VAL_0x07_gc (0x07<<2) /* Running, ExtClk Tx Rising Edge */


/* Clock Select0 bit 1 */
#define TC0_CS01_CLEAR_gc (0x00) /* Clock Select0 bit 1 - CLEAR */
#define TC0_CS01_SET_gc   (0x02) /* Clock Select0 bit 1 - SET */


/* Clock Select0 bit 0 */
#define TC0_CS00_CLEAR_gc (0x00) /* Clock Select0 bit 0 - CLEAR */
#define TC0_CS00_SET_gc   (0x01) /* Clock Select0 bit 0 - SET */


/* Clear Timer/Counter on Compare Match */
#define TC1_CTC1_CLEAR_gc (0x00) /* Clear Timer/Counter on Compare Match - CLEAR */
#define TC1_CTC1_SET_gc   (0x80) /* Clear Timer/Counter on Compare Match - SET */


/* Pulse Width Modulator Enable */
#define TC1_PWM1_CLEAR_gc (0x00) /* Pulse Width Modulator Enable - CLEAR */
#define TC1_PWM1_SET_gc   (0x40) /* Pulse Width Modulator Enable - SET */


/* Compare Output Mode, Bits */
#define TC1_COM1A_VAL_0x00_gc (0x00<<4) /* Disconnected from OCn/PWMn */
#define TC1_COM1A_VAL_0x01_gc (0x01<<4) /* Toggle OCn/PWMn output line */
#define TC1_COM1A_VAL_0x02_gc (0x02<<4) /* Clear OCn/PWMn output line */
#define TC1_COM1A_VAL_0x03_gc (0x03<<4) /* set OCn/PWMn output line */


/* Clock Select Bits */
#define TC1_CS1_VAL_0x00_gc (0x00) /* No Clock Source (Stopped) */
#define TC1_CS1_VAL_0x01_gc (0x01) /* Running, CLK*16 */
#define TC1_CS1_VAL_0x02_gc (0x02) /* Running, CLK*8 */
#define TC1_CS1_VAL_0x03_gc (0x03) /* Running, CLK*4 */
#define TC1_CS1_VAL_0x04_gc (0x04) /* Running, CLK*2 */
#define TC1_CS1_VAL_0x05_gc (0x05) /* Running, No Prescaling */
#define TC1_CS1_VAL_0x06_gc (0x06) /* Running, CLK/2 */
#define TC1_CS1_VAL_0x07_gc (0x07) /* Running, CLK/4 */
#define TC1_CS1_VAL_0x08_gc (0x08) /* Running, CLK/8 */
#define TC1_CS1_VAL_0x09_gc (0x09) /* Running, CLK/16 */
#define TC1_CS1_VAL_0x0A_gc (0x0A) /* Running, CLK/32 */
#define TC1_CS1_VAL_0x0B_gc (0x0B) /* Running, CLK/64 */
#define TC1_CS1_VAL_0x0C_gc (0x0C) /* Running, CLK/128 */
#define TC1_CS1_VAL_0x0D_gc (0x0D) /* Running, CLK/256 */
#define TC1_CS1_VAL_0x0E_gc (0x0E) /* Running, CLK/512 */
#define TC1_CS1_VAL_0x0F_gc (0x0F) /* Running, CLK/1024 */


/* OCIE1A: Timer/Counter1 Output Compare Interrupt Enable */
#define TC1_OCIE1A_CLEAR_gc (0x00) /* OCIE1A: Timer/Counter1 Output Compare Interrupt Enable - CLEAR */
#define TC1_OCIE1A_SET_gc   (0x40) /* OCIE1A: Timer/Counter1 Output Compare Interrupt Enable - SET */


/* Timer/Counter1 Overflow Interrupt Enable */
#define TC1_TOIE1_CLEAR_gc (0x00) /* Timer/Counter1 Overflow Interrupt Enable - CLEAR */
#define TC1_TOIE1_SET_gc   (0x04) /* Timer/Counter1 Overflow Interrupt Enable - SET */


/* Timer/Counter1 Output Compare Flag 1A */
#define TC1_OCF1A_CLEAR_gc (0x00) /* Timer/Counter1 Output Compare Flag 1A - CLEAR */
#define TC1_OCF1A_SET_gc   (0x40) /* Timer/Counter1 Output Compare Flag 1A - SET */


/* Timer/Counter1 Overflow Flag */
#define TC1_TOV1_CLEAR_gc (0x00) /* Timer/Counter1 Overflow Flag - CLEAR */
#define TC1_TOV1_SET_gc   (0x04) /* Timer/Counter1 Overflow Flag - SET */


/* Force Output Compare 1A */
#define TC1_FOC1A_CLEAR_gc (0x00) /* Force Output Compare 1A - CLEAR */
#define TC1_FOC1A_SET_gc   (0x04) /* Force Output Compare 1A - SET */


/* Prescaler Reset Timer/Counter1 */
#define TC1_PSR1_CLEAR_gc (0x00) /* Prescaler Reset Timer/Counter1 - CLEAR */
#define TC1_PSR1_SET_gc   (0x02) /* Prescaler Reset Timer/Counter1 - SET */


/* Prescaler Reset Timer/Counter0 */
#define TC1_PSR0_CLEAR_gc (0x00) /* Prescaler Reset Timer/Counter0 - CLEAR */
#define TC1_PSR0_SET_gc   (0x01) /* Prescaler Reset Timer/Counter0 - SET */


/*
--------------------------------------------------------------------------------
WDT - Watchdog Timer
--------------------------------------------------------------------------------
*/


/* RW */
#define WDT_WDTOE_CLEAR_gc (0x00) /* RW - CLEAR */
#define WDT_WDTOE_SET_gc   (0x10) /* RW - SET */


