stevenj/avr-libc3/include/avr/io/attiny15.h
/* CPU - CPU Registers (0x0000) */
#define CPU_BASE        _SFR_MEM8 (0x0000) /* CPU Base Address */
#define CPU_OSCCAL      _SFR_MEM8 (0x0031) /* Status Register */
#define CPU_MCUSR       _SFR_MEM8 (0x0034) /* MCU Status register */
#define CPU_MCUCR       _SFR_MEM8 (0x0035) /* MCU Control Register */
#define CPU_SREG        _SFR_MEM8 (0x003F) /* Status Register */

/* EXINT - External Interrupts (0x0000) */
#define EXINT_BASE      _SFR_MEM8 (0x0000) /* EXINT Base Address */
#define EXINT_GIFR      _SFR_MEM8 (0x003A) /* General Interrupt Flag register */
#define EXINT_GIMSK     _SFR_MEM8 (0x003B) /* General Interrupt Mask Register */

/* FUSE - Fuses (0x0000) */
#define FUSE_BASE       _SFR_MEM8 (0x0000) /* FUSE Base Address */
#define FUSE_LOW        _SFR_MEM8 (0x0000) 

/* LOCKBIT - Lockbits (0x0000) */
#define LOCKBIT_BASE    _SFR_MEM8 (0x0000) /* LOCKBIT Base Address */
#define LOCKBIT_LOCKBIT _SFR_MEM8 (0x0000) 
/* avr-libc typedef for avr/fuse.h */
typedef FUSE_t NVM_FUSES_t;

/*
================================================================================
Interrupt Vector Definitions
================================================================================
*/

/* Vector 0 is the reset vector */
#define None_RESET_vect_num       (0)                
#define None_RESET_vect           _VECTOR(0)         /* External Reset, Power-on Reset and Watchdog Reset */
#define None_INT0_vect_num        (1)                
#define None_INT0_vect            _VECTOR(1)         /* External Interrupt 0 */
#define None_IO_PINS_vect_num     (2)                
#define None_IO_PINS_vect         _VECTOR(2)         /* External Interrupt Request 0 */
#define None_TIMER1_COMP_vect_num (3)                
#define None_TIMER1_COMP_vect     _VECTOR(3)         /* Timer/Counter1 Compare Match */
#define None_TIMER1_OVF_vect_num  (4)                
#define None_TIMER1_OVF_vect      _VECTOR(4)         /* Timer/Counter1 Overflow */
#define None_TIMER0_OVF_vect_num  (5)                
#define None_TIMER0_OVF_vect      _VECTOR(5)         /* Timer/Counter0 Overflow */
#define None_EE_RDY_vect_num      (6)                
#define None_EE_RDY_vect          _VECTOR(6)         /* EEPROM Ready */
#define None_ANA_COMP_vect_num    (7)                
#define None_ANA_COMP_vect        _VECTOR(7)         /* Analog Comparator */
#define None_ADC_vect_num         (8)                
#define None_ADC_vect             _VECTOR(8)         /* ADC Conversion Ready */

/* Vector Table Size */
#define _VECTOR_SIZE              (2)                /* Size of individual vector. */
#define _VECTORS_SIZE             (9 * _VECTOR_SIZE) /* Size of all vectors */
/*
================================================================================
Constants
================================================================================
*/

#define PROGMEM_START   (0x0000)                           
#define PROGMEM_SIZE    (0x0400)                           
#define PROGMEM_END     (PROGMEM_START + PROGMEM_SIZE - 1) 

#define FLASH_START     (0x0000)                           
#define FLASH_SIZE      (0x0400)                           
#define FLASH_PAGE_SIZE (0x0080)                           
#define FLASH_END       (FLASH_START + FLASH_SIZE - 1)     

#define SIGNATURESMEM_START  (0x0000)                                       
#define SIGNATURESMEM_SIZE   (0x0003)                                       
#define SIGNATURESMEM_END    (SIGNATURESMEM_START + SIGNATURESMEM_SIZE - 1) 

#define SIGNATURES_START     (0x0000)                                       
#define SIGNATURES_SIZE      (0x0003)                                       
#define SIGNATURES_PAGE_SIZE (0x0001)                                       
#define SIGNATURES_END       (SIGNATURES_START + SIGNATURES_SIZE - 1)       

#define FUSESMEM_START  (0x0000)                             
#define FUSESMEM_SIZE   (0x0001)                             
#define FUSESMEM_END    (FUSESMEM_START + FUSESMEM_SIZE - 1) 

#define FUSES_START     (0x0000)                             
#define FUSES_SIZE      (0x0001)                             
#define FUSES_PAGE_SIZE (0x0001)                             
#define FUSES_END       (FUSES_START + FUSES_SIZE - 1)       

#define LOCKBITSMEM_START  (0x0000)                                   
#define LOCKBITSMEM_SIZE   (0x0001)                                   
#define LOCKBITSMEM_END    (LOCKBITSMEM_START + LOCKBITSMEM_SIZE - 1) 

#define LOCKBITS_START     (0x0000)                                   
#define LOCKBITS_SIZE      (0x0001)                                   
#define LOCKBITS_PAGE_SIZE (0x0001)                                   
#define LOCKBITS_END       (LOCKBITS_START + LOCKBITS_SIZE - 1)       

#define DATAMEM_START       (0x0000)                               
#define DATAMEM_SIZE        (0x0060)                               
#define DATAMEM_END         (DATAMEM_START + DATAMEM_SIZE - 1)     

#define REGISTERS_START     (0x0000)                               
#define REGISTERS_SIZE      (0x0020)                               
#define REGISTERS_PAGE_SIZE (0x0001)                               
#define REGISTERS_END       (REGISTERS_START + REGISTERS_SIZE - 1) 

#define MAPPED_IO_START     (0x0020)                               
#define MAPPED_IO_SIZE      (0x0040)                               
#define MAPPED_IO_PAGE_SIZE (0x0001)                               
#define MAPPED_IO_END       (MAPPED_IO_START + MAPPED_IO_SIZE - 1) 

#define EEPROMMEM_START         (0x0000)                               
#define EEPROMMEM_SIZE          (0x0040)                               
#define EEPROMMEM_END           (EEPROMMEM_START + EEPROMMEM_SIZE - 1) 

#define EEPROM_START            (0x0000)                               
#define EEPROM_SIZE             (0x0040)                               
#define EEPROM_PAGE_SIZE        (0x0002)                               
#define EEPROM_END              (EEPROM_START + EEPROM_SIZE - 1)       

/* Added MAPPED_EEPROM segment names for avr-libc */
#define MAPPED_EEPROM_START     (EEPROM_START)                         
#define MAPPED_EEPROM_SIZE      (EEPROM_SIZE)                          
#define MAPPED_EEPROM_PAGE_SIZE (EEPROM_PAGE_SIZE)                     
#define MAPPED_EEPROM_END       (EEPROM_END)                           

#define IOMEM_START (0x0000)                       
#define IOMEM_SIZE  (0x0040)                       
#define IOMEM_END   (IOMEM_START + IOMEM_SIZE - 1) 

#define OSCCALMEM_START  (0x0000)                               
#define OSCCALMEM_SIZE   (0x0001)                               
#define OSCCALMEM_END    (OSCCALMEM_START + OSCCALMEM_SIZE - 1) 

#define OSCCAL_START     (0x0000)                               
#define OSCCAL_SIZE      (0x0001)                               
#define OSCCAL_PAGE_SIZE (0x0001)                               
#define OSCCAL_END       (OSCCAL_START + OSCCAL_SIZE - 1)       

/* ============ Port Bits ============ */

#define PORTB0 (0) 
#define PORTB1 (1) 
#define PORTB2 (2) 
#define PORTB3 (3) 
#define PORTB4 (4) 

/*
================================================================================
Fuses/LockBits/Signatures
================================================================================
*/

/* ============ Fuses ============ */

#define FUSE_MEMORY_SIZE 0 

/* Fuse offset 0x00 */
#define CKSEL0   (unsigned char)~_BV(0) /* Clock Select bit 0 */
#define CKSEL1   (unsigned char)~_BV(1) /* Clock Select bit 1 */
#define RSTDISBL (unsigned char)~_BV(4) /* External reset function of PB5 disabled */
#define SPIEN    (unsigned char)~_BV(5) /* Serial program downloading (SPI) enabled */
#define BODEN    (unsigned char)~_BV(6) /* Brown-out detection enabled */
#define BODLEVEL (unsigned char)~_BV(7) /* Brown-out Detection Level */


/* ========== Lock Bits ========== */
#define __LOCK_BITS_EXIST  


/* ========== Signature ========== */
#define SIGNATURE_0 (0x1E) 
#define SIGNATURE_1 (0x90) 
#define SIGNATURE_2 (0x06) 

#endif /* #ifdef _AVR_ATtiny15_H_INCLUDED */
